# Задача 43: Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.
# Пример:
# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]


a = [1, 2, 3, 5, 1, 5, 3, 10]
print(a, end='' + ' -> ')
lst = []
for i in a:
	s=0
	for j in a:
		if i == j:
			s += 1
	if s == 1:
		lst.append(i)
print(lst)